"""
Марченко Андрій 141
1. Дана сторона квадрата a. Знайти його периметр P=4·a.
"""

def p(a):
    P = 4 * a
    print(P)
    input()

a=float(input("Enter a num: "))
p(a)