"""

Марченко Андрій 141
12. Дано значення кута α в градусах (0 ≤ α < 360). Обчислити значення цього ж кута в радіанах,
враховуючи, що 180 ° = π радіанів. У якості значення π використовувати 3.14.
"""
def rad(x):
    x=x*3.14/180
    print(x)


a=float(input("Enter an angle value: "))
rad(a)
